benchmarks/test-s10000000-n1-t0-C100-N500-rfalse/bench.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking ec2-3-133-121-0.us-east-2.compute.amazonaws.com (be patient)


Server Software:        
Server Hostname:        ec2-3-133-121-0.us-east-2.compute.amazonaws.com
Server Port:            8080

Document Path:          /server/size-bytes/10000000/nchunks/1/interval-ms/0/reconcile/false
Document Length:        10000002 bytes

Concurrency Level:      100
Time taken for tests:   238.663 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      5000050000 bytes
HTML transferred:       5000001000 bytes
Requests per second:    2.10 [#/sec] (mean)
Time per request:       47732.688 [ms] (mean)
Time per request:       477.327 [ms] (mean, across all concurrent requests)
Transfer rate:          20459.19 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       43  302 215.2    285    3371
Processing:  4740 43259 19045.1  45324  125416
Waiting:       91 32572 18330.1  34669  110937
Total:       4783 43561 19063.5  45782  125690

Percentage of the requests served within a certain time (ms)
  50%  45782
  66%  48642
  75%  53493
  80%  55573
  90%  58840
  95%  64498
  98%  91288
  99%  123049
 100%  125690 (longest request)